Revit 2027 API
ConnectionInputPoint.Id Property
 Unique id of this input point.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Guid Id { get; set; }
Public Property Id As Guid
	Get
	Set
public:
property Guid Id {
	Guid get ();
	void set (Guid value);
}
member Id : Guid with get, set
Property Value
Guid
See Also
Reference
ConnectionInputPoint Class
Autodesk.Revit.DB.Structure Namespace